CSI API ETABS v1

# cPointElmCountLoadDispl Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int CountLoadDispl(
    	ref int Count,
    	string Name = "",
    	string LoadPat = ""
    )

    Function CountLoadDispl (
    	ByRef Count As Integer,
    	Optional Name As String = "",
    	Optional LoadPat As String = ""
    ) As Integer

    Dim instance As cPointElm
    Dim Count As Integer
    Dim Name As String
    Dim LoadPat As String
    Dim returnValue As Integer

    returnValue = instance.CountLoadDispl(Count,
    	Name, LoadPat)

    int CountLoadDispl(
    	int% Count,
    	String^ Name = L"",
    	String^ LoadPat = L""
    )

    abstract CountLoadDispl :
            Count : int byref *
            ?Name : string *
            ?LoadPat : string
    (* Defaults:
            let _Name = defaultArg Name ""
            let _LoadPat = defaultArg LoadPat ""
    *)
    -> int

#### Parameters

Count

    Type: SystemInt32

Name (Optional)

    Type: SystemString

LoadPat (Optional)

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com